tap "achannarasappa/tap"
tap "farion1231/ccswitch"
tap "lbjlaq/antigravity-manager", "https://github.com/lbjlaq/Antigravity-Manager"
tap "productdevbook/tap"
tap "shivammathur/php"
brew "openssl@3"
brew "ansible"
brew "atuin"
brew "bat"
brew "bison"
brew "bk"
brew "btop"
brew "c-ares"
brew "cheat"
brew "chezmoi"
brew "clang-format"
brew "curl"
brew "direnv"
brew "dive"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "grpcurl"
brew "htop"
brew "imagemagick"
brew "jq"
brew "k6"
brew "lazydocker"
brew "lazygit"
brew "lua"
brew "luarocks"
brew "mise"
brew "mkcert"
brew "navi"
brew "neovim"
brew "nginx", restart_service: :changed
brew "ripgrep"
brew "opencode"
brew "optipng"
brew "php@8.1", link: true
brew "pngcrush"
brew "protobuf"
brew "re2c"
brew "redis"
brew "shfmt"
brew "telnet"
brew "terminal-notifier"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "websocat"
brew "wget"
brew "yazi"
brew "yq"
brew "zoxide"
brew "achannarasappa/tap/ticker"
brew "shivammathur/php/php@7.1", link: true
cask "alt-tab"
cask "antigravity-tools"
cask "bruno"
cask "cc-switch"
cask "chatgpt"
cask "claude-code"
cask "cursor"
cask "deepl"
cask "dingtalk"
cask "feishu"
cask "font-iosevka-nerd-font"
cask "font-lxgw-wenkai"
cask "fork"
cask "ghostty@tip"
cask "google-chrome"
cask "iina"
cask "iterm2@nightly"
cask "jetbrains-toolbox"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "pdf-expert"
cask "portkiller"
cask "postman"
cask "qq"
cask "raycast"
cask "redis-insight"
cask "setapp"
cask "switchhosts"
cask "telegram"
cask "termius"
cask "transmit"
cask "unity-hub"
cask "visual-studio-code"
cask "wave"
cask "wechat"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "ivory-lab.jenkinsfile-support"
vscode "kangping.protobuf"
vscode "maarti.jenkins-doc"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "msjsdiag.vscode-react-native"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pranjalkumar.minimal-kiwi"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "steoates.autoimport"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "zainchen.json"
